# PANDAS

In [4]:
import pandas as pd
import numpy as np

# 1 Creando un DataFrame

In [12]:
#df = pd.read_csv('ruta','nombre_columna')

#Desde un diccionario

datos = {'nombre': ['Pepe', 'María', 'Juan', 'Juana', 'Alex', 'Gema'],
         'profesion': ['Ingerio Telecomunicaciones', 'Arquitecta', 'Político', 'Informática', 'Comercial', 'Médica'],
         'edad': [ np.random.randint(25, 58) for i in range(6)],
         'salario': [ np.random.randint(1000, 5000) for i in range(6)]}

In [13]:
df = pd.DataFrame(datos)
df

  nombre                   profesion  edad  salario
0   Pepe  Ingerio Telecomunicaciones    26     3210
1  María                  Arquitecta    47     3549
2   Juan                    Político    36     2390
3  Juana                 Informática    27     1026
4   Alex                   Comercial    36     2924
5   Gema                      Médica    30     4197

# 2 Explorando un DataFrame

## 2.1 df.head()

In [14]:
df.head()

  nombre                   profesion  edad  salario
0   Pepe  Ingerio Telecomunicaciones    26     3210
1  María                  Arquitecta    47     3549
2   Juan                    Político    36     2390
3  Juana                 Informática    27     1026
4   Alex                   Comercial    36     2924

In [15]:
df.head(2)

  nombre                   profesion  edad  salario
0   Pepe  Ingerio Telecomunicaciones    26     3210
1  María                  Arquitecta    47     3549

## 2.2 df.tail()

In [16]:
df.tail(1)

  nombre profesion  edad  salario
5   Gema    Médica    30     4197

## 2.3 df.sample() --> aleatorio

In [17]:
df.sample(2)

  nombre   profesion  edad  salario
4   Alex   Comercial    36     2924
1  María  Arquitecta    47     3549

## 2.4 df.info()

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombre     6 non-null      object
 1   profesion  6 non-null      object
 2   edad       6 non-null      int64
 3   salario    6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

## 2.5 df.describe()

In [19]:
df.describe()

            edad      salario
count   6.000000     6.000000
mean   33.666667  2882.666667
std     7.814516  1092.726803
min    26.000000  1026.000000
25%    27.750000  2523.500000
50%    33.000000  3067.000000
75%    36.000000  3464.250000
max    47.000000  4197.000000

## 2.6 df.shape

In [20]:
df.shape

(6, 4)

## 2.7 df.columns

In [21]:
df.columns

Index(['nombre', 'profesion', 'edad', 'salario'], dtype='object')

** podríamos cambiar los nombres de las columnas desde aquí **

## 2.8 df.index

In [22]:
df.index

RangeIndex(start=0, stop=6, step=1)

# 3 Selección de elementos (Subset)

## 3.1 Acceso mediante etiqutas

In [26]:
df['nombre'][3]

'Juana'

In [27]:
df['nombre'] == 'María'

0    False
1     True
2    False
3    False
4    False
5    False
Name: nombre, dtype: bool

In [29]:
df[df['nombre'] == 'Alex']

  nombre  profesion  edad  salario
4   Alex  Comercial    36     2924

In [31]:
df[df['profesion'] == 'Médica']['salario']

5    4197
Name: salario, dtype: int64

## 3.2 df.iloc[] --> integer location

In [37]:
df.head(6)

  nombre                   profesion  edad  salario
0   Pepe  Ingerio Telecomunicaciones    26     3210
1  María                  Arquitecta    47     3549
2   Juan                    Político    36     2390
3  Juana                 Informática    27     1026
4   Alex                   Comercial    36     2924
5   Gema                      Médica    30     4197

In [39]:
df.iloc[3, 0:3]

nombre             Juana
profesion    Informática
edad                  27
Name: 3, dtype: object

## 3.3 df.loc

In [41]:
df.loc[3, 'profesion':'salario']

profesion    Informática
edad                  27
salario             1026
Name: 3, dtype: object

# 4 Manipulación de Datos

## 4.1 Cambiar Indice

### 4.1.1 df.set_index()

In [42]:
df

  nombre                   profesion  edad  salario
0   Pepe  Ingerio Telecomunicaciones    26     3210
1  María                  Arquitecta    47     3549
2   Juan                    Político    36     2390
3  Juana                 Informática    27     1026
4   Alex                   Comercial    36     2924
5   Gema                      Médica    30     4197

In [43]:
df.set_index('nombre')

                         profesion  edad  salario
nombre
Pepe    Ingerio Telecomunicaciones    26     3210
María                   Arquitecta    47     3549
Juan                      Político    36     2390
Juana                  Informática    27     1026
Alex                     Comercial    36     2924
Gema                        Médica    30     4197

In [44]:
df

  nombre                   profesion  edad  salario
0   Pepe  Ingerio Telecomunicaciones    26     3210
1  María                  Arquitecta    47     3549
2   Juan                    Político    36     2390
3  Juana                 Informática    27     1026
4   Alex                   Comercial    36     2924
5   Gema                      Médica    30     4197

In [45]:
df_new = df.set_index('nombre')

In [46]:
df_new

                         profesion  edad  salario
nombre
Pepe    Ingerio Telecomunicaciones    26     3210
María                   Arquitecta    47     3549
Juan                      Político    36     2390
Juana                  Informática    27     1026
Alex                     Comercial    36     2924
Gema                        Médica    30     4197

In [47]:
df.set_index('nombre', inplace = True)

In [48]:
df

                         profesion  edad  salario
nombre
Pepe    Ingerio Telecomunicaciones    26     3210
María                   Arquitecta    47     3549
Juan                      Político    36     2390
Juana                  Informática    27     1026
Alex                     Comercial    36     2924
Gema                        Médica    30     4197

In [49]:
df.reset_index()

  nombre                   profesion  edad  salario
0   Pepe  Ingerio Telecomunicaciones    26     3210
1  María                  Arquitecta    47     3549
2   Juan                    Político    36     2390
3  Juana                 Informática    27     1026
4   Alex                   Comercial    36     2924
5   Gema                      Médica    30     4197

In [50]:
df

                         profesion  edad  salario
nombre
Pepe    Ingerio Telecomunicaciones    26     3210
María                   Arquitecta    47     3549
Juan                      Político    36     2390
Juana                  Informática    27     1026
Alex                     Comercial    36     2924
Gema                        Médica    30     4197

In [51]:
df.reset_index(inplace = True)

In [52]:
df

  nombre                   profesion  edad  salario
0   Pepe  Ingerio Telecomunicaciones    26     3210
1  María                  Arquitecta    47     3549
2   Juan                    Político    36     2390
3  Juana                 Informática    27     1026
4   Alex                   Comercial    36     2924
5   Gema                      Médica    30     4197

In [55]:
df_new.loc[['Juan'],['salario']]

        salario
nombre
Juan       2390

## 4.2 df.apply()

In [57]:
df['salario'].apply(np.sqrt)

0    56.656862
1    59.573484
2    48.887626
3    32.031235
4    54.074023
5    64.784257
Name: salario, dtype: float64

In [58]:
df.select_dtypes(include = 'int64').apply(np.sqrt)

       edad    salario
0  5.099020  56.656862
1  6.855655  59.573484
2  6.000000  48.887626
3  5.196152  32.031235
4  6.000000  54.074023
5  5.477226  64.784257

In [60]:
n = list(range(5))

In [61]:
n

[0, 1, 2, 3, 4]

In [62]:
mas_1 = lambda x: x + 1

In [63]:
n = np.array(n)

In [64]:
mas_1(n)

array([1, 2, 3, 4, 5])

In [66]:
df['nombre'].apply(lambda x: x.upper())

0     PEPE
1    MARÍA
2     JUAN
3    JUANA
4     ALEX
5     GEMA
Name: nombre, dtype: object

## 4.3 df.drop()

In [67]:
df.drop('profesion', inplace = True, axis = 1)

In [68]:
df

  nombre  edad  salario
0   Pepe    26     3210
1  María    47     3549
2   Juan    36     2390
3  Juana    27     1026
4   Alex    36     2924
5   Gema    30     4197

## 4.4 df.drop_duplicates()

In [69]:
new_df = df.copy()

In [70]:
new_df

  nombre  edad  salario
0   Pepe    26     3210
1  María    47     3549
2   Juan    36     2390
3  Juana    27     1026
4   Alex    36     2924
5   Gema    30     4197

In [72]:
new_df.drop_duplicates('edad', keep = 'last')

  nombre  edad  salario
0   Pepe    26     3210
1  María    47     3549
3  Juana    27     1026
4   Alex    36     2924
5   Gema    30     4197

## 4.5 df.nlargest() df.nsmallest()

In [73]:
df.nlargest(len(df), 'salario')

  nombre  edad  salario
5   Gema    30     4197
1  María    47     3549
0   Pepe    26     3210
4   Alex    36     2924
2   Juan    36     2390
3  Juana    27     1026

In [75]:
df.sort_values(by = 'edad', ascending = False)

  nombre  edad  salario
1  María    47     3549
2   Juan    36     2390
4   Alex    36     2924
5   Gema    30     4197
3  Juana    27     1026
0   Pepe    26     3210

In [76]:
df.sort_values(by = ['edad', 'salario'])

  nombre  edad  salario
0   Pepe    26     3210
3  Juana    27     1026
5   Gema    30     4197
2   Juan    36     2390
4   Alex    36     2924
1  María    47     3549

## 4.6 df.value_counts()

In [78]:
list(df.value_counts('edad'))

[2, 1, 1, 1, 1]

## 4.7 df.rename()

In [79]:
df.rename(columns = {'edad':'años de vida'})

  nombre  años de vida  salario
0   Pepe            26     3210
1  María            47     3549
2   Juan            36     2390
3  Juana            27     1026
4   Alex            36     2924
5   Gema            30     4197

# 5 Funciones Gupas

In [80]:
df2 = df.copy()

## pd.concat()

In [83]:
df2['nombre'] = ['uno', 'dos', 'tres', 'cuatro', 'cinco', 'seis']

In [84]:
df2

   nombre  edad  salario
0     uno    26     3210
1     dos    47     3549
2    tres    36     2390
3  cuatro    27     1026
4   cinco    36     2924
5    seis    30     4197

In [85]:
pd.concat([df, df2])

   nombre  edad  salario
0    Pepe    26     3210
1   María    47     3549
2    Juan    36     2390
3   Juana    27     1026
4    Alex    36     2924
5    Gema    30     4197
0     uno    26     3210
1     dos    47     3549
2    tres    36     2390
3  cuatro    27     1026
4   cinco    36     2924
5    seis    30     4197

In [86]:
pd.concat([df, df2]).reset_index(drop = True)

    nombre  edad  salario
0     Pepe    26     3210
1    María    47     3549
2     Juan    36     2390
3    Juana    27     1026
4     Alex    36     2924
5     Gema    30     4197
6      uno    26     3210
7      dos    47     3549
8     tres    36     2390
9   cuatro    27     1026
10   cinco    36     2924
11    seis    30     4197

In [87]:
df3 = pd.concat([df, df2]).reset_index(drop = True)

In [88]:
df3

    nombre  edad  salario
0     Pepe    26     3210
1    María    47     3549
2     Juan    36     2390
3    Juana    27     1026
4     Alex    36     2924
5     Gema    30     4197
6      uno    26     3210
7      dos    47     3549
8     tres    36     2390
9   cuatro    27     1026
10   cinco    36     2924
11    seis    30     4197

## 5.2 df.where()

In [89]:
df3.where(df3['edad'] == 36)

   nombre  edad  salario
0     NaN   NaN      NaN
1     NaN   NaN      NaN
2    Juan  36.0   2390.0
3     NaN   NaN      NaN
4    Alex  36.0   2924.0
5     NaN   NaN      NaN
6     NaN   NaN      NaN
7     NaN   NaN      NaN
8    tres  36.0   2390.0
9     NaN   NaN      NaN
10  cinco  36.0   2924.0
11    NaN   NaN      NaN

In [90]:
df3.where(df3['edad'] == 36).dropna()

   nombre  edad  salario
2    Juan  36.0   2390.0
4    Alex  36.0   2924.0
8    tres  36.0   2390.0
10  cinco  36.0   2924.0

In [93]:
df3.where(df3['edad'] == 36).dropna().loc[:,'nombre']

2      Juan
4      Alex
8      tres
10    cinco
Name: nombre, dtype: object

## 5.3 df.groupby()

In [94]:
df3

    nombre  edad  salario
0     Pepe    26     3210
1    María    47     3549
2     Juan    36     2390
3    Juana    27     1026
4     Alex    36     2924
5     Gema    30     4197
6      uno    26     3210
7      dos    47     3549
8     tres    36     2390
9   cuatro    27     1026
10   cinco    36     2924
11    seis    30     4197

In [95]:
df.groupby('edad')

In [97]:
df.groupby('edad').max()

     nombre  salario
edad
26     Pepe     3210
27    Juana     1026
30     Gema     4197
36     Juan     2924
47    María     3549

In [100]:
df = pd.DataFrame(datos)

df.groupby(['edad', 'profesion']).max()

                                nombre  salario
edad profesion
26   Ingerio Telecomunicaciones   Pepe     3210
27   Informática                 Juana     1026
30   Médica                       Gema     4197
36   Comercial                    Alex     2924
     Político                     Juan     2390
47   Arquitecta                  María     3549

## 5.4 pd.pivot_table()

In [111]:
pd.pivot_table(df, index = ['edad'], columns = ['edad'])

/tmp/ipykernel_18260/927374843.py:1: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  pd.pivot_table(df, index = ['edad'], columns = ['edad'])

     salario
edad      26      27      30      36      47
edad
26    3210.0     NaN     NaN     NaN     NaN
27       NaN  1026.0     NaN     NaN     NaN
30       NaN     NaN  4197.0     NaN     NaN
36       NaN     NaN     NaN  2657.0     NaN
47       NaN     NaN     NaN     NaN  3549.0

**ojito a esta función mirar documentación**

# 6 Fechas

## 6.1 Crear Fechas

In [114]:
fechas = pd.date_range(start = '1 January 2000', end = '1 March 2023', freq = 'MS')
fechas

DatetimeIndex(['2000-01-01', '2000-02-01', '2000-03-01', '2000-04-01',
               '2000-05-01', '2000-06-01', '2000-07-01', '2000-08-01',
               '2000-09-01', '2000-10-01',
               ...
               '2022-06-01', '2022-07-01', '2022-08-01', '2022-09-01',
               '2022-10-01', '2022-11-01', '2022-12-01', '2023-01-01',
               '2023-02-01', '2023-03-01'],
              dtype='datetime64[ns]', length=279, freq='MS')

In [115]:
formato = "%d/%m/%Y"
fechas.strftime(formato)

Index(['01/01/2000', '01/02/2000', '01/03/2000', '01/04/2000', '01/05/2000',
       '01/06/2000', '01/07/2000', '01/08/2000', '01/09/2000', '01/10/2000',
       ...
       '01/06/2022', '01/07/2022', '01/08/2022', '01/09/2022', '01/10/2022',
       '01/11/2022', '01/12/2022', '01/01/2023', '01/02/2023', '01/03/2023'],
      dtype='object', length=279)